app/controllers/letters_controller.rb

    def index
        text = params[:text]
        @letter = Letter.new
        @letter.save

        @letters = Letter.all
---
INSERT INTO "letters" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "오예"], ["created_at", "2021-06-19 12:02:01.299499"], ["updated_at", "2021-06-19 12:02:01.299499"]]
SELECT "letters".* FROM "letters"

    def show
        text = params[:text]
        @letter = Letter.new
        @letter.text = @@t.strftime("%Y/%m/%d %H:%M ") + text
        @letter.save

        @letters = Letter.all
---
INSERT INTO "letters" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "다음다음"], ["created_at", "2021-06-19 12:12:15.893205"], ["updated_at", "2021-06-19 12:12:15.893205"]]
SELECT "letters".* FROM "letters"